test/integration/load-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test/integration/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/3m00.0s

running (0m02.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m02.0s/3m00.0s

running (0m03.0s), 03/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m03.0s/3m00.0s

running (0m04.0s), 04/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/30 VUs  0m04.0s/3m00.0s

running (0m05.0s), 05/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m05.0s/3m00.0s

running (0m06.0s), 06/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 06/30 VUs  0m06.0s/3m00.0s

running (0m07.0s), 07/30 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 07/30 VUs  0m07.0s/3m00.0s

running (0m08.0s), 08/30 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 08/30 VUs  0m08.0s/3m00.0s

running (0m09.0s), 09/30 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 09/30 VUs  0m09.0s/3m00.0s

running (0m10.0s), 10/30 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 10/30 VUs  0m10.0s/3m00.0s

running (0m11.0s), 11/30 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 11/30 VUs  0m11.0s/3m00.0s

running (0m12.0s), 12/30 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 12/30 VUs  0m12.0s/3m00.0s

running (0m13.0s), 13/30 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 13/30 VUs  0m13.0s/3m00.0s

running (0m14.0s), 14/30 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 14/30 VUs  0m14.0s/3m00.0s

running (0m15.0s), 15/30 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 15/30 VUs  0m15.0s/3m00.0s

running (0m16.0s), 16/30 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 16/30 VUs  0m16.0s/3m00.0s

running (0m17.0s), 17/30 VUs, 7 complete and 0 interrupted iterations
default   [   9% ] 17/30 VUs  0m17.0s/3m00.0s

running (0m18.0s), 18/30 VUs, 8 complete and 0 interrupted iterations
default   [  10% ] 18/30 VUs  0m18.0s/3m00.0s

running (0m19.0s), 19/30 VUs, 8 complete and 0 interrupted iterations
default   [  11% ] 19/30 VUs  0m19.0s/3m00.0s

running (0m20.0s), 20/30 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 20/30 VUs  0m20.0s/3m00.0s

running (0m21.0s), 21/30 VUs, 12 complete and 0 interrupted iterations
default   [  12% ] 21/30 VUs  0m21.0s/3m00.0s

running (0m22.0s), 22/30 VUs, 13 complete and 0 interrupted iterations
default   [  12% ] 22/30 VUs  0m22.0s/3m00.0s

running (0m23.0s), 23/30 VUs, 13 complete and 0 interrupted iterations
default   [  13% ] 23/30 VUs  0m23.0s/3m00.0s

running (0m24.0s), 24/30 VUs, 16 complete and 0 interrupted iterations
default   [  13% ] 24/30 VUs  0m24.0s/3m00.0s

running (0m25.0s), 25/30 VUs, 18 complete and 0 interrupted iterations
default   [  14% ] 25/30 VUs  0m25.0s/3m00.0s

running (0m26.0s), 26/30 VUs, 19 complete and 0 interrupted iterations
default   [  14% ] 26/30 VUs  0m26.0s/3m00.0s

running (0m27.0s), 27/30 VUs, 21 complete and 0 interrupted iterations
default   [  15% ] 27/30 VUs  0m27.0s/3m00.0s

running (0m28.0s), 28/30 VUs, 22 complete and 0 interrupted iterations
default   [  16% ] 28/30 VUs  0m28.0s/3m00.0s

running (0m29.0s), 29/30 VUs, 27 complete and 0 interrupted iterations
default   [  16% ] 29/30 VUs  0m29.0s/3m00.0s

running (0m30.0s), 29/30 VUs, 29 complete and 0 interrupted iterations
default   [  17% ] 29/30 VUs  0m30.0s/3m00.0s

running (0m31.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m31.0s/3m00.0s

running (0m32.0s), 30/30 VUs, 31 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m32.0s/3m00.0s

running (0m33.0s), 30/30 VUs, 36 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m33.0s/3m00.0s

running (0m34.0s), 30/30 VUs, 37 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m34.0s/3m00.0s

running (0m35.0s), 30/30 VUs, 41 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m35.0s/3m00.0s

running (0m36.0s), 30/30 VUs, 44 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m36.0s/3m00.0s

running (0m37.0s), 30/30 VUs, 47 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m37.0s/3m00.0s

running (0m38.0s), 30/30 VUs, 50 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m38.0s/3m00.0s

running (0m39.0s), 30/30 VUs, 54 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m39.0s/3m00.0s

running (0m40.0s), 30/30 VUs, 55 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m40.0s/3m00.0s

running (0m41.0s), 30/30 VUs, 57 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m41.0s/3m00.0s

running (0m42.0s), 30/30 VUs, 59 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m42.0s/3m00.0s

running (0m43.0s), 30/30 VUs, 61 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m43.0s/3m00.0s

running (0m44.0s), 30/30 VUs, 63 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m44.0s/3m00.0s

running (0m45.0s), 30/30 VUs, 66 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m45.0s/3m00.0s

running (0m46.0s), 30/30 VUs, 70 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m46.0s/3m00.0s

running (0m47.0s), 30/30 VUs, 74 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m47.0s/3m00.0s

running (0m48.0s), 30/30 VUs, 78 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m48.0s/3m00.0s

running (0m49.0s), 30/30 VUs, 80 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m49.0s/3m00.0s

running (0m50.0s), 30/30 VUs, 85 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m50.0s/3m00.0s

running (0m51.0s), 30/30 VUs, 87 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m51.0s/3m00.0s

running (0m52.0s), 30/30 VUs, 89 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m52.0s/3m00.0s

running (0m53.0s), 30/30 VUs, 89 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m53.0s/3m00.0s

running (0m54.0s), 30/30 VUs, 91 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m54.0s/3m00.0s

running (0m55.0s), 30/30 VUs, 95 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m55.0s/3m00.0s

running (0m56.0s), 30/30 VUs, 98 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m56.0s/3m00.0s

running (0m57.0s), 30/30 VUs, 101 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m57.0s/3m00.0s

running (0m58.0s), 30/30 VUs, 104 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m58.0s/3m00.0s

running (0m59.0s), 30/30 VUs, 108 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  0m59.0s/3m00.0s

running (1m00.0s), 30/30 VUs, 111 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m00.0s/3m00.0s

running (1m01.0s), 30/30 VUs, 112 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m01.0s/3m00.0s

running (1m02.0s), 30/30 VUs, 115 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m02.0s/3m00.0s

running (1m03.0s), 30/30 VUs, 119 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m03.0s/3m00.0s

running (1m04.0s), 30/30 VUs, 122 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m04.0s/3m00.0s

running (1m05.0s), 30/30 VUs, 124 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m05.0s/3m00.0s

running (1m06.0s), 30/30 VUs, 126 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m06.0s/3m00.0s

running (1m07.0s), 30/30 VUs, 127 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m07.0s/3m00.0s

running (1m08.0s), 30/30 VUs, 131 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m08.0s/3m00.0s

running (1m09.0s), 30/30 VUs, 134 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m09.0s/3m00.0s

running (1m10.0s), 30/30 VUs, 137 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m10.0s/3m00.0s

running (1m11.0s), 30/30 VUs, 141 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m11.0s/3m00.0s

running (1m12.0s), 30/30 VUs, 145 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m12.0s/3m00.0s

running (1m13.0s), 30/30 VUs, 145 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m13.0s/3m00.0s

running (1m14.0s), 30/30 VUs, 148 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m14.0s/3m00.0s

running (1m15.0s), 30/30 VUs, 151 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m15.0s/3m00.0s

running (1m16.0s), 30/30 VUs, 154 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m16.0s/3m00.0s

running (1m17.0s), 30/30 VUs, 156 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m17.0s/3m00.0s

running (1m18.0s), 30/30 VUs, 161 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m18.0s/3m00.0s

running (1m19.0s), 30/30 VUs, 163 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m19.0s/3m00.0s

running (1m20.0s), 30/30 VUs, 165 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m20.0s/3m00.0s

running (1m21.0s), 30/30 VUs, 167 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m21.0s/3m00.0s

running (1m22.0s), 30/30 VUs, 169 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m22.0s/3m00.0s

running (1m23.0s), 30/30 VUs, 174 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m23.0s/3m00.0s

running (1m24.0s), 30/30 VUs, 176 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m24.0s/3m00.0s

running (1m25.0s), 30/30 VUs, 179 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m25.0s/3m00.0s

running (1m26.0s), 30/30 VUs, 181 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m26.0s/3m00.0s

running (1m27.0s), 30/30 VUs, 183 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m27.0s/3m00.0s

running (1m28.0s), 30/30 VUs, 187 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m28.0s/3m00.0s

running (1m29.0s), 30/30 VUs, 191 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m29.0s/3m00.0s

running (1m30.0s), 30/30 VUs, 193 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m30.0s/3m00.0s

running (1m31.0s), 30/30 VUs, 196 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m31.0s/3m00.0s

running (1m32.0s), 30/30 VUs, 201 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m32.0s/3m00.0s

running (1m33.0s), 30/30 VUs, 203 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m33.0s/3m00.0s

running (1m34.0s), 30/30 VUs, 204 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m34.0s/3m00.0s

running (1m35.0s), 30/30 VUs, 208 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m35.0s/3m00.0s

running (1m36.0s), 30/30 VUs, 210 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m36.0s/3m00.0s

running (1m37.0s), 30/30 VUs, 213 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m37.0s/3m00.0s

running (1m38.0s), 30/30 VUs, 214 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m38.0s/3m00.0s

running (1m39.0s), 30/30 VUs, 218 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m39.0s/3m00.0s

running (1m40.0s), 30/30 VUs, 223 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m40.0s/3m00.0s

running (1m41.0s), 30/30 VUs, 224 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m41.0s/3m00.0s

running (1m42.0s), 30/30 VUs, 227 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m42.0s/3m00.0s

running (1m43.0s), 30/30 VUs, 229 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m43.0s/3m00.0s

running (1m44.0s), 30/30 VUs, 233 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m44.0s/3m00.0s

running (1m45.0s), 30/30 VUs, 235 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m45.0s/3m00.0s

running (1m46.0s), 30/30 VUs, 237 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m46.0s/3m00.0s

running (1m47.0s), 30/30 VUs, 240 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m47.0s/3m00.0s

running (1m48.0s), 30/30 VUs, 242 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m48.0s/3m00.0s

running (1m49.0s), 30/30 VUs, 245 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m49.0s/3m00.0s

running (1m50.0s), 30/30 VUs, 246 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m50.0s/3m00.0s

running (1m51.0s), 30/30 VUs, 249 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m51.0s/3m00.0s

running (1m52.0s), 30/30 VUs, 253 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m52.0s/3m00.0s

running (1m53.0s), 30/30 VUs, 255 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m53.0s/3m00.0s

running (1m54.0s), 30/30 VUs, 259 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m54.0s/3m00.0s

running (1m55.0s), 30/30 VUs, 262 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m55.0s/3m00.0s

running (1m56.0s), 30/30 VUs, 266 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m56.0s/3m00.0s

running (1m57.0s), 30/30 VUs, 268 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m57.0s/3m00.0s

running (1m58.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m58.0s/3m00.0s

running (1m59.0s), 30/30 VUs, 273 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m59.0s/3m00.0s

running (2m00.0s), 30/30 VUs, 274 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m00.0s/3m00.0s

running (2m01.0s), 30/30 VUs, 278 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m01.0s/3m00.0s

running (2m02.0s), 30/30 VUs, 280 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m02.0s/3m00.0s

running (2m03.0s), 30/30 VUs, 283 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m03.0s/3m00.0s

running (2m04.0s), 30/30 VUs, 284 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m04.0s/3m00.0s

running (2m05.0s), 30/30 VUs, 290 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m05.0s/3m00.0s

running (2m06.0s), 30/30 VUs, 292 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m06.0s/3m00.0s

running (2m07.0s), 30/30 VUs, 295 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m07.0s/3m00.0s

running (2m08.0s), 30/30 VUs, 299 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m08.0s/3m00.0s

running (2m09.0s), 30/30 VUs, 303 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m09.0s/3m00.0s

running (2m10.0s), 30/30 VUs, 305 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m10.0s/3m00.0s

running (2m11.0s), 30/30 VUs, 306 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m11.0s/3m00.0s

running (2m12.0s), 30/30 VUs, 311 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m12.0s/3m00.0s

running (2m13.0s), 30/30 VUs, 312 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m13.0s/3m00.0s

running (2m14.0s), 30/30 VUs, 316 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m14.0s/3m00.0s

running (2m15.0s), 30/30 VUs, 319 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m15.0s/3m00.0s

running (2m16.0s), 30/30 VUs, 322 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m16.0s/3m00.0s

running (2m17.0s), 30/30 VUs, 325 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m17.0s/3m00.0s

running (2m18.0s), 30/30 VUs, 326 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m18.0s/3m00.0s

running (2m19.0s), 30/30 VUs, 329 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m19.0s/3m00.0s

running (2m20.0s), 30/30 VUs, 333 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m20.0s/3m00.0s

running (2m21.0s), 30/30 VUs, 335 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m21.0s/3m00.0s

running (2m22.0s), 30/30 VUs, 337 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m22.0s/3m00.0s

running (2m23.0s), 30/30 VUs, 344 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m23.0s/3m00.0s

running (2m24.0s), 30/30 VUs, 346 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m24.0s/3m00.0s

running (2m25.0s), 30/30 VUs, 347 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m25.0s/3m00.0s

running (2m26.0s), 30/30 VUs, 350 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m26.0s/3m00.0s

running (2m27.0s), 30/30 VUs, 352 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m27.0s/3m00.0s

running (2m28.0s), 30/30 VUs, 356 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m28.0s/3m00.0s

running (2m29.0s), 30/30 VUs, 358 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m29.0s/3m00.0s

running (2m30.0s), 30/30 VUs, 363 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m30.0s/3m00.0s

running (2m31.0s), 30/30 VUs, 366 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m31.0s/3m00.0s

running (2m32.0s), 30/30 VUs, 368 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m32.0s/3m00.0s

running (2m33.0s), 29/30 VUs, 371 complete and 0 interrupted iterations
default   [  85% ] 29/30 VUs  2m33.0s/3m00.0s

running (2m34.0s), 29/30 VUs, 376 complete and 0 interrupted iterations
default   [  86% ] 29/30 VUs  2m34.0s/3m00.0s

running (2m35.0s), 29/30 VUs, 377 complete and 0 interrupted iterations
default   [  86% ] 29/30 VUs  2m35.0s/3m00.0s

running (2m36.0s), 29/30 VUs, 378 complete and 0 interrupted iterations
default   [  87% ] 29/30 VUs  2m36.0s/3m00.0s

running (2m37.0s), 28/30 VUs, 379 complete and 0 interrupted iterations
default   [  87% ] 28/30 VUs  2m37.0s/3m00.0s

running (2m38.0s), 28/30 VUs, 381 complete and 0 interrupted iterations
default   [  88% ] 28/30 VUs  2m38.0s/3m00.0s

running (2m39.0s), 27/30 VUs, 383 complete and 0 interrupted iterations
default   [  88% ] 27/30 VUs  2m39.0s/3m00.0s

running (2m40.0s), 26/30 VUs, 386 complete and 0 interrupted iterations
default   [  89% ] 26/30 VUs  2m40.0s/3m00.0s

running (2m41.0s), 24/30 VUs, 390 complete and 0 interrupted iterations
default   [  89% ] 24/30 VUs  2m41.0s/3m00.0s

running (2m42.0s), 23/30 VUs, 392 complete and 0 interrupted iterations
default   [  90% ] 23/30 VUs  2m42.0s/3m00.0s

running (2m43.0s), 23/30 VUs, 396 complete and 0 interrupted iterations
default   [  91% ] 23/30 VUs  2m43.0s/3m00.0s

running (2m44.0s), 22/30 VUs, 399 complete and 0 interrupted iterations
default   [  91% ] 22/30 VUs  2m44.0s/3m00.0s

running (2m45.0s), 21/30 VUs, 402 complete and 0 interrupted iterations
default   [  92% ] 21/30 VUs  2m45.0s/3m00.0s

running (2m46.0s), 20/30 VUs, 405 complete and 0 interrupted iterations
default   [  92% ] 20/30 VUs  2m46.0s/3m00.0s

running (2m47.0s), 20/30 VUs, 407 complete and 0 interrupted iterations
default   [  93% ] 20/30 VUs  2m47.0s/3m00.0s

running (2m48.0s), 19/30 VUs, 408 complete and 0 interrupted iterations
default   [  93% ] 19/30 VUs  2m48.0s/3m00.0s

running (2m49.0s), 18/30 VUs, 409 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  2m49.0s/3m00.0s

running (2m50.0s), 18/30 VUs, 410 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  2m50.0s/3m00.0s

running (2m51.0s), 16/30 VUs, 415 complete and 0 interrupted iterations
default   [  95% ] 16/30 VUs  2m51.0s/3m00.0s

running (2m52.0s), 16/30 VUs, 415 complete and 0 interrupted iterations
default   [  96% ] 16/30 VUs  2m52.0s/3m00.0s

running (2m53.0s), 15/30 VUs, 416 complete and 0 interrupted iterations
default   [  96% ] 15/30 VUs  2m53.0s/3m00.0s

running (2m54.0s), 13/30 VUs, 419 complete and 0 interrupted iterations
default   [  97% ] 13/30 VUs  2m54.0s/3m00.0s

running (2m55.0s), 11/30 VUs, 421 complete and 0 interrupted iterations
default   [  97% ] 11/30 VUs  2m55.0s/3m00.0s

running (2m56.0s), 10/30 VUs, 423 complete and 0 interrupted iterations
default   [  98% ] 10/30 VUs  2m56.0s/3m00.0s

running (2m57.0s), 09/30 VUs, 426 complete and 0 interrupted iterations
default   [  98% ] 09/30 VUs  2m57.0s/3m00.0s

running (2m58.0s), 07/30 VUs, 428 complete and 0 interrupted iterations
default   [  99% ] 07/30 VUs  2m58.0s/3m00.0s

running (2m59.0s), 06/30 VUs, 429 complete and 0 interrupted iterations
default   [  99% ] 06/30 VUs  2m59.0s/3m00.0s

running (3m00.0s), 06/30 VUs, 429 complete and 0 interrupted iterations
default   [ 100% ] 06/30 VUs  3m00.0s/3m00.0s

running (3m01.0s), 05/30 VUs, 430 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m02.0s), 05/30 VUs, 430 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m03.0s), 04/30 VUs, 431 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m04.0s), 03/30 VUs, 432 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m05.0s), 03/30 VUs, 432 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m06.0s), 02/30 VUs, 433 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s

running (3m07.0s), 01/30 VUs, 434 complete and 0 interrupted iterations
default ↓ [ 100% ] 06/30 VUs  3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    image_fail
    ✓ 'rate<0.01' rate=0.00%

    rate_limited_429
    ✓ 'count==0' count=0

    t_detail
    ✓ 'p(95)<1000' p(95)=242.88ms

    t_feed
    ✓ 'p(95)<1000' p(95)=408.82ms

    t_image
    ✓ 'p(95)<3000' p(95)=891.53ms

    t_search
    ✓ 'p(95)<1000' p(95)=294.08ms


  █ TOTAL RESULTS 

    checks_total.......: 2175    11.602547/s
    checks_succeeded...: 100.00% 2175 out of 2175
    checks_failed......: 0.00%   0 out of 2175

    ✓ 피드 200
    ✓ 상세 200
    ✓ 이미지 200
    ✓ 검색 200
    ✓ 아티스트 200

    CUSTOM
    image_fail.....................: 0.00%  0 out of 435
    rate_limited_429...............: 0      0/s
    t_artists......................: avg=140.46ms p(90)=319.44ms p(95)=405.96ms p(99)=535.5ms  max=1.08s   
    t_detail.......................: avg=65.32ms  p(90)=144.77ms p(95)=242.88ms p(99)=338.24ms max=477.29ms
    t_feed.........................: avg=148.83ms p(90)=308.23ms p(95)=408.82ms p(99)=675.26ms max=915.79ms
    t_image........................: avg=302.19ms p(90)=663.77ms p(95)=891.53ms p(99)=1.37s    max=1.9s    
    t_search.......................: avg=99.41ms  p(90)=246.12ms p(95)=294.08ms p(99)=428.32ms max=504.17ms

    HTTP
    http_req_duration..............: avg=151.24ms p(90)=344.88ms p(95)=476.49ms p(99)=917.86ms max=1.9s    
      { expected_response:true }...: avg=151.24ms p(90)=344.88ms p(95)=476.49ms p(99)=917.86ms max=1.9s    
    http_req_failed................: 0.00%  0 out of 2175
    http_reqs......................: 2175   11.602547/s

    EXECUTION
    iteration_duration.............: avg=10.78s   p(90)=12.45s   p(95)=12.88s   p(99)=13.88s   max=14.06s  
    iterations.....................: 435    2.320509/s
    vus............................: 1      min=1         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 106 MB 567 kB/s
    data_sent......................: 864 kB 4.6 kB/s



running (3m07.5s), 00/30 VUs, 435 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  3m0s